emacs.org
*** Paredit
#+begin_src emacs-lisp :tangle beyeran/beyeran-paredit.el
;;;;;;;; paredit ;;;;;;;;
(require 'paredit)

(when (require 'paredit "paredit" t)
  (mapc (lambda (hook) (add-hook hook (lambda () (paredit-mode 1))))
        '(emacs-lisp-mode-hook
          slime-repl-mode-hook
          slime-mode-hook
          inferior-qi-mode-hook
          qi-mode-hook
          scheme-mode
          clojure-mode-hook)))
#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-paredit.el
(provide 'beyeran-paredit)
#+end_src

*** smex
#+begin_src emacs-list :tangle beyeran/beyeran-smex.el
;;;;;;; smex ;;;;;;;
(and (require 'ido "ido" t)
     (ido-mode t)
     (require 'smex "smex" t)
     (smex-initialize)
     (setq smex-save-file "~/.smex")
     (smex-auto-update))

(provide 'beyeran-smex)
#+end_src
* Org-Mode
** generall settings
#+begin_src emacs-lisp :tangle beyeran/beyeran-org.el
;;;;;;;; org-mode ;;;;;;;;
(require 'org)
(require 'tempo)
;(require 'notify)
;(require 'org-remember)

(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))

(setq org-agenda-files (list "~/Documents/org/uni.org"
			     "~/Documents/org/freetime.org"
			     "~/Documents/org/home.org"
			     "~/Documents/org/dates.org"
			     "~/Documents/org/music.org"))

(setq org-directory "~/Documents/org/")
(setq org-default-notes-file "~/Documents/org/dairy")
(setq remember-annotation-functions '(org-remember-annotation))
(setq remember-handler-functions '(org-remember-handler))
(add-hook 'remember-mode-hook 'org-remember-apply-template)

(define-key global-map (kbd "C-c l") 'org-store-link)
(define-key global-map (kbd "C-c a") 'org-agenda)
(define-key global-map (kbd "C-c r") 'org-remember)

(setq org-log-done t)
(setq org-support-shift-select t)
(setq org-agenda-include-diary t)
(setq org-src-fontify-natively t)
(setq tempo-interactive t)


(setq org-todo-keyword-faces '(("NEXT" . (:foreground "yellow" :background "red" :bold t :weight bold))
			       ("TODO" . (:foreground "yellow" :background "forestgreen" :bold t :weight bold))
			       ("WAITING" . (:foreground "magenta" :background "red" :bold t :weight bold))
			       ("TESTING" . (:foreground "cyan" :bold t :weight bold))
			       ("RELEASED" . (:foreground "greenyellow" :bold t :weight bold))
			       ("PLANNED" . (:foreground "gray70" :bold t :weight bold))
			       ("DONE" . (:foreground "goldenrod" :bold t :weight bold))))

(setq org-startup-folded nil)

(defun org-cycle-global ()
  (interactive)
  (org-cycle t))

(defun org-cycle-local ()
  (interactive)
  (save-excursion
    (move-beginning-of-line nil)
    (org-cycle)))

(setq org-export-with-section-numbers nil)
#+end_src
** Fontifiying todo items outside of org-mode
#+begin_src emacs-lisp :tangle beyeran/beyeran-org.el
;;;; Forntifying todo items outside of org-mode ;;;;
;; thanks to David O'Toole
(defface todo-comment-face '((t (:background "red" :foreground "yellow" :weight bold :bold t))) "Face for TODO in code buffers.")

(defvar todo-comment-face 'todo-comment-face)
(defun fontify-todo ()
  (font-lock-add-keywords nil '(("\\<\\(TODO\\)\\>"
				 (1 todo-comment-face t)))))

(add-hook 'emacs-lisp-mode-hook #'fontify-todo)
(add-hook 'lisp-mode-hook #'fontify-todo)

(defface headline-face '((t (:foreground "white" :underline "white" :background "navyblue"))) "Face for headlines.")

(defun fontify-headline ()
  (font-lock-add-keywords nil '(("^;;;;* \\(.*\\)\\>"
				 (1 headline-face t)))))

(add-hook 'emacs-lisp-mode-hook #'fontify-headline)
(add-hook 'lisp-mode-hook #'fontify-headline)
#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-org.el
(provide 'beyeran-org)
#+end_src
** Org Babel
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-babel.el
;;; fontification ;;;
(setq org-src-fontify-natively t)

;;; org babel ;;;
(require 'ob)
(require 'ob-eval)
(require 'ob-lisp)
(require 'ob-ruby)

(setq org-src-fontify-natevely t)
(setq org-confirm-babel-evaluate nil)

(setq org-babel-load-languages (quote ((emacs-lisp . t)
				       (dot . t)
				       (ditaa . t)
				       (R . t)
				       (python . t)
				       (ruby . t)
				       (gnuplot . t)
				       (clojure . t)
				       (sh . t))))
(setq org-confirm-babel-evaluate nil)
#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-org-babel.el
(provide 'beyeran-org-babel)
#+end_src
** remember templates
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-remember.el
;;;; remember templates ;;;;;
(setq org-remember-templates
      '(("university" ?u "* TODO %? %^g\n %i\n " "~/Documents/org/uni.org" "University")
	("home" ?h "* TODO %? %^g\n %i\n " "~/Documents/org/home.org" "Home")
	("free time" ?f "* TODO %? %^g\n %i\n " "~/Documents/org/freetime.org" "Leisure Time")
	("Journal" ?j "\n* %^{topic} %T :JOURNAL: \n%i%?\n" "~/Documents/journal.org")
	("Book" ?b "\n* %^{Book Title} %t :READING: \n%[~/Documents/booktemp.txt]\n" 
	 "~/Documents/journal.org")
	("Receipt"   ?r "** %^{BriefDesc} %U %^g\n%?"   "~/Documents/org/finances.org")
	("Film" ?m "** %^{Film Title} %t :FILM: \n%[~/Documents/.film_template.txt]\n" 
	 "~/Documents/journal.org")
	("Someday"   ?s "** %^{Someday Heading} %U\n%?\n"  "~/Documents/org/someday.org")
	("Vocab"   ?v "** %^{Word?}\n%?\n"  "~/Documents/org/vocab.org")
	("Daily Review" ?a "** %t :COACH: \n%[~/Documents/.daily_review.txt]\n" 
	 "~/Documents/org/journal.org")))
#+end_src
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-remember.el
(provide 'beyeran-org-remember)
#+end_src
** reftex
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-reftex.el
;;;; reftex ;;;;

(defun org-mode-reftex-setup ()
  (load-library "reftex")
  (and (buffer-file-name) (file-exists-p (buffer-file-name))
       (progn
	 ;enable auto-revert-mode to update reftex when bibtex file changes on disk
	 (global-auto-revert-mode t)
	 (reftex-parse-all)
	 ;add a custom reftex cite format to insert links
	 (reftex-set-cite-format
	  '((?b . "[[bib:%l][%l-bib]]")
	    (?n . "[[notes:%l][%l-notes]]")
	    (?p . "[[papers:%l][%l-paper]]")
	    (?t . "%t")
	    (?h . "** %t\n:PROPERTIES:\n:Custom_ID: %l\n:END:\n[[papers:%l][%l-paper]]")))))
  (define-key org-mode-map (kbd "C-c )") 'reftex-citation)
  (define-key org-mode-map (kbd "C-c (") 'org-mode-reftex-search))

(add-hook 'org-mode-hook 'org-mode-reftex-setup)


(defun org-mode-reftex-search ()
  ;;jump to the notes for the paper pointed to at from reftex search
  (interactive)
  (org-open-link-from-string (format "[[notes:%s]]" (reftex-citation t))))


(setq org-link-abbrev-alist
      '(("bib" . "~/research/refs.bib::%s")
	("notes" . "~/research/org/notes.org::#%s")
	("papers" . "~/research/papers/%s.pdf")))
#+end_src
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-reftex.el
(provide 'beyeran-org-reftex)
#+end_src
** Org Mode Export Templates
*** Koma
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-export-templates.el
;; #+LaTeX_CLASS: beamer
(unless (boundp 'org-export-latex-classes)
 (setq org-export-latex-classes nil))
(add-to-list 'org-export-latex-classes
             '("koma"
               "\\documentclass[a4paper,12pt]{scrartcl}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+end_src
*** Beamer
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-export-templates.el
;; Beamer
;; #+LaTeX_CLASS: beamer in org files
(add-to-list 'org-export-latex-classes
	     ;; beamer class, for presentations
	     '("beamer"
	       "\\documentclass[10pt]{beamer}\n
      \\mode<{{{beamermode}}}>\n
      \\usetheme{{{{beamertheme}}}}\n
      \\usecolortheme{{{{beamercolortheme}}}}\n
      \\beamertemplateballitem\n
      \\setbeameroption{show notes}
      \\usepackage[utf8]{inputenc}\n
      \\usepackage{hyperref}\n
      \\usepackage{color}
      \\usepackage{listings}
      \\lstset{numbers=none,language=[ISO]C++,tabsize=4,
  frame=single,
  basicstyle=\\small,
  showspaces=false,showstringspaces=false,
  showtabs=false,
  keywordstyle=\\color{blue}\\bfseries,
  commentstyle=\\color{red},
  }\n
      \\usepackage{verbatim}\n
      \\institute{{{{beamerinstitute}}}}\n          
       \\subject{{{{beamersubject}}}}\n"

	       ("\\section{%s}" . "\\section*{%s}")

	       ("\\begin{frame}[fragile]\\frametitle{%s}"
          "\\end{frame}"
          "\\begin{frame}[fragile]\\frametitle{%s}"
          "\\end{frame}")))
#+end_src
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-export-templates.el
(provide 'beyeran-org-export-templates)
#+end_src
* Programming Languages
** Lisp
*** Slime
  I've installed quicklisp and in one documentation for it I've found
  this "slime helper" which works quite fine. There will be some
  additions for Scheme and Clojure development.

  ;;;;;;;; slime helper (from quicklisp)
  (load (expand-file-name "~/.config/quicklisp/slime-helper.el"))
  ;; (setq inferior-lisp-program "/Applications/CCL/dx86cl64")
  ;; (setq inferior-lisp-program "/Applications/AllegroCL/alisp")
  (setq inferior-lisp-program "/usr/bin/ccl")

#+begin_src emacs-lisp :tangle beyeran/beyeran-slime.el
(sys-diversification
  (load (expand-file-name "~/.quicklisp/slime-helper.el"))
  ())

(sys-diversification
  (setq inferior-lisp-program "/Applications/CCL/dx86cl")
  (setq inferior-lisp-program "/usr/bin/sbcl"))

(require 'slime "slime" t)

(slime-setup '(slime-fancy slime-asdf slime-references slime-indentation))

(setq slime-enable-evaluate-in-emacs t
      slime-net-coding-system 'utf-8-unix
 ;;     lisp-indent-function 'cl-indent:function 
 )

;;(setq slime-lisp-implementations
;;      `((sbcl ,@(list (sys-diversification "/opt/local/bin/sbcl " "/usr/bin/sbcl ")))
;;       (clisp ("clisp" "-E utf-8" "-modern"))
;;        )
;;      slime-default-lisp 'sbcl)

(add-hook 'slime-mode-hook
          (lambda ()
            (define-keys slime-mode-map
                '(("C-c s" slime-selector)
                  ("C-j" newline-and-indent)
                  ("TAB" slime-indent-and-complete-symbol)
                  ("C-c C-d c" cltl2-lookup)))))

(add-hook 'slime-repl-mode-hook
          (lambda ()
            (define-keys slime-repl-mode-map
                '(("C-c s" slime-selector)
                  ("C-c C-d c" cltl2-lookup)))))
#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-slime.el
(provide 'beyeran-slime)
#+end_src
